utils/miscutils/rsync.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rsync</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">rsync</h1>

<div id="outline-container-orge68ba79" class="outline-2">
<h2 id="orge68ba79">switches</h2>
<div class="outline-text-2" id="text-orge68ba79">
<pre class="example">
-a, --archive               archive mode; equals -rlptgoD (no -H,-A,-X)
-v, --verbose               increase verbosity
-t, --times                 preserve modification times
-n, --dry-run               perform a trial run with no changes made

-e, --rsh=COMMAND           specify the remote shell to use

    --progress              show progress during transfer
-c, --checksum              skip based on checksum, not mod-time &amp; size
-i, --itemize-changes       output a change-summary for all updates
    --delete                delete extraneous files from dest dirs

-b, --backup                make backups (see --suffix &amp; --backup-dir)
</pre>
</div>
</div>

<div id="outline-container-orgda3d351" class="outline-2">
<h2 id="orgda3d351">examples</h2>
<div class="outline-text-2" id="text-orgda3d351">
</div>
<div id="outline-container-org60aff61" class="outline-3">
<h3 id="org60aff61">ssh</h3>
<div class="outline-text-3" id="text-org60aff61">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #73d216;"># </span><span style="color: #73d216;">homer-pc is a host alias in ~/.ssh</span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">mirror</span>
rsync -avt -e ssh --delete --progress /home/homer/public_html/ <span style="color: #e9b96e;">\</span>
      homer-pc:/var/www/html/

rsync -avt -e ssh --progress file.txt homer-pc:/home/homer/test/
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d6f6ce" class="outline-3">
<h3 id="org3d6f6ce">diff</h3>
<div class="outline-text-3" id="text-org3d6f6ce">
<div class="org-src-container">
<pre class="src src-sh">rsync -avt --checksum --itemize-changes A/ B/
</pre>
</div>

<p>
<a href="./miscutils.html">back</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
